{
  "cards": [
    {
      "id": 1,
      "front": "What is the Virtual DOM?",
      "back": "The virtual DOM is a lightweight copy of the real DOM used for performance optimization.",
      "status": "Want To Learn",
      "lastModified": "2024-01-01T09:15:00Z"
    },{
      "id": 2,
      "front": "Who is the best villain?",
      "back": "TOM RIDDLE.",
      "status": "Learned",
      "lastModified": "2024-01-01T09:15:00Z"
    },
    {
      "id": 3,
      "front": "What is the useEffect hook used for?",
      "back": "useEffect is used for handling side effects in functional components, such as data fetching or subscriptions.",
      "status": "Learned",
      "lastModified": "2024-01-02T08:55:00Z"
    },
    {
      "id": 4,
      "front": "What is the main purpose of a Docker container?",
      "back": "Docker containers provide a lightweight and portable way to package, distribute, and run applications along with their dependencies.",
      "status": "Noted",
      "lastModified": "2024-01-07T12:45:00Z"
    },
    {
      "id": 5,
      "front": "What philosophical themes does Tom Riddle's transformation into Lord Voldemort represent in the Harry Potter series?",
      "back": "Tom Riddle's transformation symbolizes the corrupting influence of power, the consequences of seeking immortality, and explores ethical dilemmas surrounding choices and prejudices.",
      "status": "Noted",
      "lastModified": "2024-01-14T08:15:00Z"
    },
    {
      "id": 6,
      "front": "Explain the concept of entropy in the context of information theory.",
      "back": "Entropy is a measure of the uncertainty or disorder in a set of data. In information theory, it represents the average amount of surprise or information content in a message.",
      "status": "Learned",
      "lastModified": "2024-01-08T09:30:00Z"
    },
    {
      "id": 7,
      "front": "What is the difference between machine learning and deep learning?",
      "back": "Machine learning is a broader concept involving algorithms that improve over time through experience, while deep learning is a subset of machine learning that specifically deals with neural networks with multiple layers.",
      "status": "Noted",
      "lastModified": "2024-01-09T14:15:00Z"
    },
    {
      "id": 18,
      "front": "Describe the concept of quantum entanglement in physics.",
      "back": "Quantum entanglement is a phenomenon where two or more particles become interconnected and the state of one particle instantly influences the state of the others, regardless of the distance between them.",
      "status": "Noted",
      "lastModified": "2024-01-10T11:00:00Z"
    },
    {
      "id": 9,
      "front": "What is the significance of the Turing Test in artificial intelligence?",
      "back": "The Turing Test is a measure of a machine's ability to exhibit intelligent behavior indistinguishable from that of a human, often used to assess the level of artificial intelligence in a system.",
      "status": "Learned",
      "lastModified": "2024-01-11T16:20:00Z"
    },
    {
      "id": 10,
      "front": "What are React Hooks?",
      "back": "React Hooks are functions that enable functional components to use state and lifecycle features.",
      "status": "Want to Learn",
      "lastModified": "2023-01-15T09:30:00Z"
    }
  ],
  "messages": [
    {
      "name": "Tom Riddle",
      "email": "tommarvoloriddle@gmail.com",
      "subject": "Important Notice",
      "text": "I left behind a diary, preserving my sixteen-year-old self in its pages, so that one day, with luck, I would be able to lead another in my footsteps, and finish Salazar Slytherin’s noble work.",
      "id": 3
    },
    {
      "name": "Christian Coulson",
      "email": "christiancl@gmail.com",
      "subject": "Test",
      "text": "We have exam tomorrow!!",
      "id": 4
    }
  ]
}